app/controllers/comments_controller.rb

SELECT  "shows".* FROM "shows" WHERE "shows"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("contenu", "user_id", "pseudo", "show_id", "created_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["contenu", "Je l'attendais depuis longtemps !!!"], ["user_id", 1], ["pseudo", "qkab78"], ["show_id", 1], ["created_at", 2016-11-21 21:23:42 UTC]]
---
  def create
    @comment = Comment.new(params.require(:comment).permit(:contenu))
    @comment.user_id = current_user.id
    @comment.pseudo = current_user.pseudo
    @comment.show = Show.find(params[:show_id])
    if @comment.save