app/controllers/homes_controller.rb

  def index
  	@shows = Show.all
---
SELECT  "shows".* FROM "shows" LIMIT $1  [["LIMIT", 1]]