app/controllers/reservations_controller.rb

  def create
    @resa = Reservation.new(resa_params)
    p "nb place dispo avant resa: #{@show.place}"
    @resa.show = Show.find(params[:show_id])
    @show.place -= @resa.nb_tickets

    if @resa.save #true ou false
---
SELECT  "shows".* FROM "shows" WHERE "shows"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "reservations" ("firstname", "lastname", "email", "nb_tickets", "show_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["firstname", "anthony"], ["lastname", "ait lhadj"], ["email", "anthony.aitlhadj@gmail.com"], ["nb_tickets", 3], ["show_id", 2]]
UPDATE "shows" SET "place" = $1 WHERE "shows"."id" = $2  [["place", 99], ["id", 2]]

  def find_concert
    @show = Show.find(params[:show_id])
---
SELECT  "shows".* FROM "shows" WHERE "shows"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]