app/controllers/shows_controller.rb

  def index
    @shows = Show.search(params[:search])
---
SELECT "shows".* FROM "shows" WHERE (name LIKE 'Linkin Park')

  def create
    @show = Show.new(shows_params)
    if @show.save
---
INSERT INTO "shows" ("name", "date", "place", "adress", "price") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "test1"], ["date", Sun, 01 Jan 2017], ["place", 100], ["adress", "mamamam a"], ["price", "20"]]

  def edit
    @show = Show.find(params[:id])
---
SELECT  "shows".* FROM "shows" WHERE "shows"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @show = Show.find(params[:id])
    if @show.update(shows_params)
---
SELECT  "shows".* FROM "shows" WHERE "shows"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "shows" SET "name" = $1, "price" = $2 WHERE "shows"."id" = $3  [["name", "LOODDDOOOOL"], ["price", "200000000"], ["id", 6]]

  def show
    @show = Show.find(params[:id])
    @comment = Comment.new
    @comments = Comment.where(show_id: @show).order("created_at DESC")
---
SELECT  "shows".* FROM "shows" WHERE "shows"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."show_id" = 2 ORDER BY created_at DESC

  def destroy

    @show = Show.find(params[:id])
    @show.destroy
---
SELECT  "shows".* FROM "shows" WHERE "shows"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "shows" WHERE "shows"."id" = $1  [["id", 2]]