app/controllers/users_controller.rb

  def create
     if @user.save
---
INSERT INTO "users" ("email", "crypted_password", "salt", "created_at", "updated_at", "firstname", "lastname", "pseudo") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"